import React from 'react';
import MeetingsSlider from './MeetingsSlider';
import Header from '../mainpage/Header';
import Footer from '../mainpage/Footer';
import { useNavigate } from 'react-router-dom';


const Meetings = () => {
    const navigate = useNavigate()
    return ( 
        <>
            <div>
                <Header/>

                <div className='meetingsBox'>
                    <div className='sliderBox'>
                        <MeetingsSlider/>
                    </div>
                    <div className='meetingsTitleBox'>
                        <h2>جلسات</h2>
                        <p>خدمات جلسات</p>
                        <button onClick={()=>navigate('/ReqForResMeetingRooms')}>درخواست رزرو سالن ها</button>
                    </div>
                </div>
                <div className='meetingsDescription'>
                    <h2>ما غیر ممکن ها را ممکن میکنیم تا هر جلسات را بی عیب و نقص برگزار کنیم. </h2>
                    <p>متخصصان کارآزموده ما در واحد فروش و بازاریابی هتل آریا نهایت تلاش خود را برای برگزاری رویدادهای کامل در هر مقیاسی انجام خواهند داد. ما با افتخار فرصت های اجتماعی و محیطی الهام بخشی را برای مهمانان محترم ایجاد میکنیم تا تفاوتی ماندگار و اصیل داشته باشیم. این برنامه ها شامل فعالیت هایی مانند جلسه ناهار، پذیرایی و سرو قهوه می باشند که در دستور کار کنفرانس قرارمی گیرند. کارشناسان جلسات ما در بخش فروش و بازاریابی و متخصصین پذیرایی در دفتر پروتکل، پذیرایی و ضیافتی خلاقانه را از موضوع جلسه ی شما نمایش می دهند و یا پیشنهاداتی را برای سرگرمی و تعامل بیشتر ارائه می دهند. مهمانان گروهی می توانند استراحتی کوتاه در روز کاری خود داشته باشند و با همکاران خود در کافه غروب خورشید گرد هم آیند. این زمان آرام در خارج از اتاق کنفرانس و در تراس کافه، می تواند یک تجربه به یاد ماندنی و تحکیم کننده روابط باشد. </p>
                    <h4>خدمات صوتی و تصویری</h4>
                    <p>متخصصان صوتی / تصویری ما پشتیبانی فنی را ارائه می دهند. تجهیزات زیر در دسترس هستند:</p>
                    <p>تجهیزات و خدمات</p>
                    <ul>
                        <li>میکروفون های سیمی و بی سیم </li>
                        <li>میکسر صدا </li>
                        <li>پروژکتور، پخش کننده ویدئو</li>
                        <li>صفحه نمایش سه پایه</li>
                        <li>صفحه نمایش سریع </li>
                        <li>سخنرانان </li>
                        <li>پخش کننده های صوتی</li>
                        <li>موسیقی</li>
                        <li>امکانات ارائه / ارائه لپ تاپ</li>
                        <li> اینترنت</li>
                        <li> رایانه / لپ تاپ</li>
                        <li>دستگاه های دورنگار</li>
                        <li>دستگاه های کپی</li>
                        <li>چاپگر</li>
                        <li>نمودارها / بردها </li>
                        <li>سایر خدمات جلسه</li>
                        <li>برچسب نام و چاپ کارت محل</li>
                        <li>لوازم اداری</li>
                        <li> مرکز کسب و کار اجرایی</li>
                        <li>کرایه تاکسی، خدمات ماشین و شاتل</li>
                        <li>اجاره تلفن همراه </li>
                    </ul>


                </div>

                <Footer/>
            </div>
        </>
     );
}
 
export default Meetings;