import React from 'react';
import CityTourSlider from './CityTourSlider'
import TouristPlace from './TouristPlace';
import img1 from '../../image/tourism/small1.jpg';
import img2 from '../../image/tourism/small2.jpeg';
import img3 from '../../image/tourism/small3.jpeg';
import img4 from '../../image/tourism/small4.jpeg';
import img5 from '../../image/tourism/small5.jpeg';

const CityTour = ({setFlag}) => {
   
    const places = [
        {id:1, image:img1, title: 'کاخ گلستان', description: 'کاخ گلستان، عمارت سابق سلطنتی قاجار در پایتخت ایران، تهران است. کاخ گلستان یکی از قدیمی ترین آثار تاریخی شهر تهران و میراث جهانی می باشد که متعلق به گروهی از ساختمان های سلطنتی بوده است که دردوره ای از تاریخ متعلق به دیوارهای خشتی تهران ("ارگ") بودند. این مجموعه شامل باغ ها، ساختمان های سلطنتی و مجموعه های صنایع دستی ایران و اروپا از قرن های ١٨ و ١٩ می باشد. این کاخ در فاصله ٢٠.٦ کیلومتری هتل قرار گرفته است و ٣٣ دقیقه با هتل فاصله دارد. '},
        {id:2, image:img2, title:'مجتمع سعدآباد ', description:'مجتمع سعدآباد یک مجموعه ٣٠٠هکتاری است که توسط پادشاهان قاجار و پهلوی ساخته شده و در شمیران تهران واقع شده است. در حال حاضر محل اقامت رسمی رئیس جمهور ایران در مجاورت این مجتمع قرار دارد. این مجموعه شامل بیش از ١٨٠ هکتار از جنگل های طبیعی، خیابان ها، قنات ها، گالری ها و موزه ها است. این مجتمع در قرن نوزدهم ساخته شد و خانواده سلطنتی قاجاردر آن ساکن شدند. پس از آن رضا شاه و محمدرضا پهلوی از سلسله پهلوی در آنجا زندگی می کردند. پس از انقلاب سال ١٣٥٧، این مجتمع به موزه تبدیل شد. این مجموعه در فاصله ٩.٩ کیلومتری واقع شده و ٢٥دقیقه با هتل فاصله دارد.'},
        {id:3, image:img3, title:'پارک تفریحی ارم ', description: 'شهر بازی ارم بزرگترین شهر بازی در ایران است. این پارک در سال ١٣٥٠ توسط اسدالله خرم تاسیس شد، پس از مرگ او، این پارک همچنان تا سال ١٣٥٧ به نام او بود. پارک ارم در آزاد راه تهران-کرج واقع در استان تهران و مساحت ٧٠ هکتار قرار دارد. ارم شامل امکاناتی نظیر دو پارک آبی با بیش از ١٢٠ دستگاه برای کودکان و بزرگسالان، یک باغ وحش با بیش از ١١٠ گونه و یک دریاچه هشت هکتاری سرپوشیده برای اسکی ، اسکی کابل، قایقرانی ، رستوران فست فود، کافه ها و سایر رستوران ها است. این مجموعه در فاصله ١٦.١ کیلومتری هتل واقع شده و ٢٤ دقیقه با آن فاصله دارد. '},
        {id:4, image:img4, title:'مجتمع نیاوران', description: 'مجتمع نیاوران یک مجموعه تاریخی است که در شمیران (شمال تهران) ایران واقع شده است. این مجموعه شامل چندین ساختمان و بنای تاریخی است که مربوط به دوران قاجار و پهلوی می باشد. این مجموعه در فاصله ١٦ کیلومتری هتل واقع شده و ٢٧دقیقه با آن فاصله دارد.'},
        {id:5, image:img5, title: 'دربند ', description:'دربند در گذشته روستایی در نزدیکی تجریش، در شمیران بوده و محله ای است که در محدوده شهری تهران قرار دارد. از این منطقه می توان پیاده روی خاطره انگیزی را در مسیر کوه محبوب توچال در ارتفاعات تهران داشت. همچنین امکان استفاده از تله کابین برای کسانی که مایل به کوه نوردی نیستند نیز فراهم است. مسیر اولیه دربند حدود ٢٥٠ متر است که در آن تعدادی کافه و رستوران دنج وجود دارد. این مکان های محبوب در طول شبانه روز به صورت مداوم مشغول خدمت رسانی هستند، چرا که هم مردم محلی و هم گردشگران از بسیاری از اقامتگاه های تفریحی در این مسیر دیدن می کنند. این مجموعه در فاصله ١٠.٩کیلومتری هتل قرار گرفته و ٢٦ دقیقه با آن اصله دارد. '}
    ]

    return ( 
        <>
            <div className='cityTourBox'>
                <div className='sliderBox'>
                    <CityTourSlider/>
                </div>
                <div className='titleBox'>
                    <button onClick={()=>setFlag('tour')}>موقعیت های گردشگری</button>
                    <h2>با علاقه سفر کنید!</h2>
                    <button onClick={()=>setFlag('shoppingtrip')}>خرید در شهر</button>
                </div>
            </div>
            <div>
                {
                    places.map((place) => (
                        <TouristPlace id={place.id} image={place.image} title={place.title} description={place.description}/>
                    ))
                }
            </div>
        </>
     );
}
 
export default CityTour;