import React from 'react';
import Header from './mainpage/Header';
import Footer from './mainpage/Footer';
import img from '../image/about/1.jpg'


const AboutHotel = () => {
    return ( 
        <>
            <div className='aboutHotelBox'>
                <Header/>

                <div>
                    <div className='imgBox'>
                        <div>
                            <img src={img} alt='img'/>
                        </div>
                        <div>
                            <h2>مروری بر مشخصات هتل</h2>
                        </div>
                    </div>
                    <div className='aboutParBox'>
                        <div className='smallBox'>
                            <p>در این هتل همه ی انتظاراتی که از یک هتل پنج ستاره می رود به بهترین نحو پاسخ داده می شود. این ویژگی سبب شده است تا همه ی مهمانان اقامت راحت و دلچسبی را تجربه کنند. ما از اینکه پذیرای حضور گرم شما در هتل آریا باشیم عمیقا خوشحال خواهیم بود. </p>
                        </div>
                        <div className='largBox'>
                            <h2>دروازه ی زیبای هتل آریا را نظاره گر باشید</h2>
                            <p> هتل آریا با قرار گرفتن در منطقه ی شمال تهران مانند جواهری نهان در یک بهشت آرام نگاه ها را به خود خیره می کند. این هتل با در نظر گرفتن انتظارات متفاوت، خدمات لوکس متفاوتی را ارائه می دهد. همچنین، طراحی این هتل با استفاده از معماری معاصر و متاثر از معماری حیرت انگیز گذشته، سلیقه های همه ی سنین را در نظر گرفته است. شاید به همین خاطر باشد که اسم آن را "کاخ" انتخاب کرده اند. علاوه بر این، به عنوان یکی از بهترین ساختمان های موجود در تهران، این کاخ چشم نواز شامل یک لابی باشکوه، فضاهای عمومی شگرف و مخصوصا اتاق های مجهز و استاندارد می باشد. در این هتل همه ی انتظاراتی که از یک هتل پنج ستاره می رود به بهترین نحو پاسخ داده می شود. این ویژگی سبب شده است تا همه ی مهمانان اقامت راحت و دلچسبی را تجربه کنند. ما از اینکه پذیرای حضور گرم شما در هتل آریا باشیم عمیقا خوشحال خواهیم بود. </p>
                            <h4>ویژگی ها و امکانات اتاق</h4>
                            <p>هر اتاق شامل:</p>
                            <ul>
                                <li>تشک های نرم </li>
                                <li>تخت خواب های نرم و راحت</li>
                                <li>حمام و دستشویی </li>
                                <li>حوله لباسی حمام</li>
                                <li>حوله های جاذب، نرم و پنبه ای</li>
                                <li>آینه های حمام ضد بخار</li>
                                <li>سردوش مخصوص</li>
                                <li>وسایل ضروری لوکس حمام</li>
                                <li>تلویزیون LCD با وضوح تصویر عالی </li>
                                <li>چای ساز در اتاق</li>
                                <li>صندوق امانات بزرگ داخل اتاق</li>
                                <li>روم سرویس بیست و چهار ساعته اتاق</li>
                                <li>ورودی مجهز به چراغ های سنسوری</li>
                                <li> دو چراغ دیوارکوب بالای تخت ها </li>
                                <li>ریز خروجی برق روی میز کار (در صورت نیاز نصب می شود) </li>
                                <li>مرکز سلامت</li>
                                <li>واکس کفش</li>
                                <li>قهوه و چای رایگان</li>
                                <li>روزنامه ی رایگان</li>
                                <li>خدمات لباس شویی و خشک شویی</li>
                                <li>اتاق چمدان</li>
                                <li>ترانسفر فرودگاهی برای فرودگاه امام خمینی به صورت 24 ساعته امکان پذیر است (هزینه به صورت مجزا اعمال میگردد) </li>
                                <li>پرسنل چندزبانه</li>
                            </ul>
                            <h4>بیزینس سنتر</h4>
                            <ul>
                                <li>خدمات کپی </li>
                                <li>پرینت</li>
                                <li>خدمات بیزنس سنتر</li>
                            </ul>
                            <h4>قوانین هتل</h4>
                            <p>ورود/ خروج</p>
                            <ul>
                                <li>ورود در ساعت ١۵:٠٠ </li>
                                <li>خروج در ساعت 11:٠٠</li>
                            </ul>
                            <h4>قوانین کنسلی</h4>
                            <ul>
                                <li>جهت کنسل کردن رزرو خود لطفا تا ٤٨ساعت قبل از ورود موارد کنسلی را با هتل هماهنگ کنید</li>
                            </ul>
                            <h4>استعمال دخانیات</h4>
                            <ul>
                                <li>استعمال دخانیات فقط در اتاق های سیگار آزاد واقع در طبقات 4 و 5 هتل مجاز می باشد. جهت اطلاعات بیشتر در مورد نحوه رزرو اتاق های سیگار آزاد با همکاران ما در واحد رزرواسیون در ارتباط باشید.</li>
                            </ul>
                            <h4>امکانات و خدمات رایگان هر اتاق</h4>
                            <ul>
                                <li>بوفه صبحانه رایگان</li>
                                <li>اینترنت پرسرعت بیست و چهار ساعته و نامحدود با سیم و بی سیم با پهنای باند بالا</li>
                                <li>استفاده رایگان از باشگاه ورزشی استخر، سونا و جکوزی</li>
                                <li>پارکینگ</li>
                            </ul>
                            <h4>مرکز سلامت </h4>
                            <p>این مجموعه با هدف برآورده سازی همه ی نیازهای سلامتی جسمی شما طراحی شده است:</p>
                            <ul>
                                <li>فضایی مجزا، گسترده و آرامش بخش برای خانم ها و آقایان</li>
                                <li>مربی های حرفه ای، باسواد و انگیزه دهنده که مشوق شما خواهند بود</li>
                                <li>کمدهای معین همگانی و کمدهای شخصی</li>
                                <li>فضایی دوستانه در جهت رفع نیازهای همه ی میهمانان</li>
                                <li>سونای بخار، سونای خشک و جکوزی </li>
                                <li>استخرهای استاندارد با دمای کنترل شده</li>
                                <li>خدمات زیبایی خانم ها </li>
                                <li>خدمات زیبایی آقایان </li>
                                <li>خدمات حرفه ای ماساژ (با رزرو قبلی)</li>
                            </ul>
                            <h4>ساعات کاری مرکز سلامت</h4>
                            <p>بانوان: ١١:٠٠ تا ۲١:٠٠ </p>
                            <p>بانوان: ١١:٠٠ تا ۲١:٠٠ </p>
                        </div>
                    </div>
                </div>





                <Footer/>
            </div>
        </>
     );
}
 
export default AboutHotel;