import React from 'react';
import Header from '../mainpage/Header';
import Slider from './Slider';
import Footer from '../mainpage/Footer';
import img from '../../image/health center/small-photo.jpg'

const HealthCenter = () => {
    return ( 
        <>
            <Header/>

            <div>
                <div className='healthCenterBox'>
                    <div className='healthCenterBoxSlider'>
                        <Slider/>
                    </div>
                    <div className='healthCenterBoxText'>
                        <h2>مراکز سلامتی</h2>
                        <p>خدمات زیبایی اقایان</p>
                        <p>خدمات زیبایی بانوان</p>
                        <p>خدمات ماساژ</p>
                        <p>خدمات مجموعه </p>
                        <p>مجموعه فان سنتر</p>
                    </div>
                </div>
                <div className='smallImgBox'>
                    <div className='imgTitleBox'>
                        <img src={img} alt='img'/><br/>
                        <span>درباره هتل آریا </span>
                        <p>هتل آریا با ارائه ی مجموعه ای از خدمات رفاهی و تفریحی متنوع، از بهترین هتل های تهران است. اقامت در این هتل همیشه باعث به جاماندن خاطرات فراموش نشدنی برای مهمانان خارجی و ایرانی آن بوده است. ما از اینکه در این هتل پذیرای مهمانان گرامی باشیم مفتخر خواهیم بود. هتل آریا با احترام به کسانی که این هتل را برای اقامت انتخاب می کنند، تمامی امکانات و سرویس های رفاهی یک هتل پنج ستاره ی لوکس را دارا می باشد. علاوه بر این، جذابیت های گیرای دکوراسیون خاص آن همراه با فضای صمیمی و راحتی که موجبات آرامش و آسایش را فراهم می آورد، از دیگر عواملی است که این هتل را محبوبترین هتل تهران ساخته است.</p>
                    </div>
                    <div className='mainBoxRezBox'>
                        <h2>مرکز سلامتی هتل آریا </h2>
                        <p>حس آرامش و جوانی را در مرکز سلامت لوکس ما، که در طبقه ی منفی سه قرار گرفته است، تجربه کنید. ساعاتی به دور از شلوغی و آلودگی شهر باشید. مرکز سلامتی هتل آریا با در برداشتن فضای اختصاصی مجزا برای خانم ها و آقایان و بهره مندی از تیم حرفه ای، مجموعه ای کامل از خدمات سلامتی و زیبایی را ارائه می دهد تا تجربه ای بی نظیر و آرامش بخش داشته باشید. </p>
                        <div className='mainRezBox'>
                            <h2>درهتل آریا از سلامتی خود مراقبت کنید</h2>
                            <div className='rezBox'>
                                <h3>رزرو از طریق تلفن</h3>
                                <p>برای کسب اطلاعات بیشتر و رزرو خدمات لطفا با شماره 02175675 تماس حاصل فرمایید.</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

            
            <Footer/>
        </>
     );
}
 
export default HealthCenter;