import React from 'react';
import img from '../../image/introduction/main-palace.jpg';

const Introduction = () => {
    return ( 
        <div className='introductionBox'>
            <div>
                <p className='parBox'>

هتل آریا با قرار گرفتن در منطقه ی شمال تهران مانند جواهری نهان در یک بهشت آرام نگاه ها را به خود خیره می کند. این هتل با در نظر گرفتن انتظارات متفاوت، خدمات لوکس متفاوتی را ارائه می دهد. همچنین، طراحی این هتل با استفاده از معماری معاصر و متاثر از معماری حیرت انگیز گذشته، سلیقه های همه ی سنین را در نظر گرفته است. شاید به همین خاطر باشد که اسم آن را "کاخ" انتخاب کرده اند. علاوه بر این، به عنوان یکی از بهترین ساحتمان های موجود در تهران، این کاخ چشم نواز شامل یک لابی باشکوه، فضاهای عمومی شگرف و مخصوصا اتاق های مجهز و استاندارد می باشد. در این هتل همه ی انتظاراتی که از یک هتل پنج ستاره می رود به بهترین نحو پاسخ داده می شود. این ویژگی سبب شده است تا همه ی مهمانان اقامت راحت و دلچسبی را تجربه کنند. ما از اینکه پذیرای حضور گرم شما در هتل آریا باشیم عمیقا خوشحال خواهیم بود.
</p>
            </div>
            <div>
                <img src={img} alt='introduction'></img>
            </div>
        </div>
     );
}
 
export default Introduction;