import React from 'react';
import Header from '../mainpage/Header';
import Footer from '../mainpage/Footer';
import WeddingSlider from './WeddingSlider';
import { useNavigate } from 'react-router-dom';

const WeddingCeremonies = () => {
    const navigate = useNavigate();
    return ( 
        <>
            <div>
                <Header/>

                <div className='weddingSliderBox'>
                    <div className='SliderBox'>
                        <WeddingSlider/>
                    </div>
                    <div>
                        <h2>مراسم عروسی</h2>
                        <button onClick={()=>navigate('/ReqForResWedHalls')}>درخواست رزرو سالن ها</button>
                    </div>
                </div>
                <div className='weddingDescriptionBox'>
                    <h3>طلوع زندگی خود را در هتل آریا جشن بگیرید! </h3>
                    <p>پیوند خود را در هتل آریا جشن بگیرید تا خاطرات فراموش نشدنی را برای یک عمر به یادگار بگذارید. باشد که این مراسم بهانه ای برای دورهمی عزیزان صمیمیتان و یا جشنی باشکوه برای نمایش عشق شما به دنیا باشد. شما می توانید ازدواج رویایی خود را در تالار سالن گرند و اتاق های چند منظوره برگزار کنید. مدیریت رویدادهای اختصاصی و تیم غذا و نوشیدنی ما متعهد به ارائه بهترین گزینه های آشپزی بین المللی و ایرانی هستند. سالن امیران هتل آریا یکی از محبوب ترین مراکز شهر برای برگزاری بزرگترین مراسم های ازدواج است. کاخ های ما، ایوان و سالن های پارس، تنظیمات بسیاری برای برگزاری هرچه صمیمی تر مراسم دارند. سالن گرند برای برگزاری مراسم ازدواج باستانی شرقی مناسب است. متخصصان مراسم ازدواج ما روز عروسی شما را هماهنگ خواهند کرد و شما تنها باید "بله" را بگویید. </p>
                    <p>از شما دعوت می کنیم با متخصصان مراسم ازدواج ما با شماره ٧٥٦٧٥(٢١) تماس بگیرید تا برنامه عروسی خود را شروع کنید یا درخواست خود را به صورت آنلاین ارائه دهید. </p>
                    <p>میتوانید از میان سالن های مراسم زیبا و ظریف داخلی ما انتخاب کنید و ما در برنامه ریزی ازدواج ویژه شما در تهران با انجام موارد زیر به شما کمک خواهیم کرد:</p>
                    <ul>
                        <li>انتخاب تدارکات مراسم ازدواج </li>
                        <li>مکانی ایده آل برای مراسم ازدواج، پذیرش و سایر مراسم ها</li>
                        <li>طراحی جذاب و تزیینات در بر گیرنده سلیقه و ترجیحات شخصی</li>
                        <li> هماهنگی تیم آشپزی برای ایجاد یک منو لذت بخش با انتخاب طعم </li>
                    </ul>
                </div>

                <Footer/>

            </div>
        </>
     );
}
 
export default WeddingCeremonies;